IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

PROCEDURE DIVISION.
   A-PARA.
   PERFORM B-PARA 4 TIMES.
   DISPLAY 'BARBARA ANN'.
   STOP RUN.
   
   B-PARA.
   DISPLAY 'BA '.
